Repository: kugiigi/indicator-darkmode
Catalog: po/*.po
Languages: fr, nl

source: Suru Dark mode Indicator
fr: Indicateur de mode Suru sombre
nl: Donkerthema-indicator

source: What is this?
fr: Qu'est-ce que c'est ?
nl: Wat is dit?

source: This is a proof of concept for an indicator to switch between Ambiance and Suru Dark theme.
fr: Il s'agit d'un démonstrateur pour un indicateur permettant de basculer entre les thèmes Ambiance et Suru sombre.
nl: Dit is een proef omtrent het wisselen tussen het Ambiance- en Suru donker-thema.

source: What does it exactly do?
fr: Que fait-il exactement ?
nl: Wat doet de indicator precies?

source: It modifies the theme in the config file "/home/phablet/.config/ubuntu-ui-toolkit/theme.ini"
fr: Il modifie le thème dans le fichier de configuration "/home/phablet/.config/ubuntu-ui-toolkit/theme.ini"

source: How does it work?
fr: Comment marche-t-il ?
nl: Hoe werkt de indicator?

source: Enabling Dark Mode from the indicator will switch to the theme "Suru Dark".
fr: L'activation du mode sombre à partir l'indicateur fera basculer le thème sur "Suru sombre".
nl: Schakel het donkere thema in in de indicator om over te schakelen naar Suru donker.

source: Disabling it will revert back to "Ambiance".
fr: Sa désactivation le fera revenir sur "Ambiance".
nl: Schakel uit om terug te gaan naar Ambiance.

source: There is also an option to switch the theme automatically based on the time.
fr: Il existe également une option pour basculer le thème automatiquement en fonction de l'heure.
nl: Er is tevens een optie om het thema automatisch te wijzigen op bepaalde tijdstippen.

source: Anything else?
fr: Quoi d'autre ?
nl: Nog meer wat ik moet weten?

source: The theme change won't take effect on currently open apps until they are restarted.
fr: Le changement de thème ne prendra effet sur les applications actuellement ouvertes que lorsque celles-ci seront redémarrées.
nl: Start geopende apps opnieuw op om het nieuwe thema toe te passen.

source: Time accuracy for automatically switching to a theme will be based on the set time interval for checking the time.
fr: La précision de l'heure pour le basculement automatique du thème sera basée sur l'intervalle de temps fixé pour la vérification de l'heure.
nl: De tijdnauwkeurigheid van de automatische themawijziging is gebaseerd op de ingestelde tussenpoos.

source: Impact on battery is still unknown but do let me know if you notice significant reduction of battery.
fr: L'impact sur la batterie est encore inconnu, mais faites-moi savoir si vous remarquez une réduction significative de la batterie.
nl: Of het impact heeft op de accuduur is vooralsnog onbekend. Laat me weten als je merkt dat de accuduur verkort is.

source: Some devices such as the Pinephone and Meizu MX4 may have less accurate scheduled switching due to their deep sleep behavior.
fr: Certains appareils tels que le Pinephone et le Meizu MX4 peuvent avoir une bascule programmée moins précise en raison de leur comportement en hibernation.
nl: Op sommige apparaten, zoals de Pinephone en Meizu MX4, is de automatische themawijziging mogelijk minder nauwkeurig door hun slaapstandgedrag.

source: For these devices, it is advised to use lower interval time and just observe the battery.
fr: Pour ces appareils, il est conseillé d'utiliser un temps d'intervalle plus court et d'observer simplement la batterie.
nl: Op deze apparaten raad ik aan een lagere tussenpoos in te stellen en de accuduur in de gaten houden.

source: For other devices such as the Nexus 5, it's fine to set the interval to max 60 minutes and it'll still be accurate.
fr: Pour d'autres appareils tels que le Nexus 5, il suffit de régler l'intervalle sur 60 minutes maximum et il sera toujours précis.
nl: Op andere apparaten, zoals de Nexus 5, kun je de tussenpoos prima op 60 minuten instellen.

source: Suru Dark theme support varies across apps. There are apps that just works while some will only have partial support and some won't even respect it.
fr: La prise en charge du thème Suru sombre varie en fonction des applications. Certaines applications fonctioneront tout simplement, tandis que d'autres présenteront uniquement une prise en charge partielle et que d'autres ne le respecteront même pas.
nl: Het donkere Suru-thema wordt wisselend ondersteund. Sommige apps ondersteunen het volledig, andere deels en sommige helemaal niet.

source: Reinstall the indicator and reboot or restart Lomiri whenever an update is installed.
fr: Réintaller l'indicateur et réinitialiser ou redémarrer Lomiri lorsqu'une mise à jour est installée.

source: Schedule Settings
fr: Configuration des horaires
nl: Tijdschema

source: Start time
fr: Heure de démarrage
nl: Begintijd

source: End time
fr: Heure de fin
nl: Eindtijd

source: Time check interval (minutes)
fr: Intervalle de vérification du temps (en minutes)
nl: Controletussenpoos (in minuten)

source: This determines how often the indicator will check the time and if there's a need to toggle the theme.
fr: Ceci détermine à quelle fréquence l'indicateur vérifiera l'heure et s'il y a besoin de basculer le thème.
nl: Hiermee geef je aan hoe vaak de indicator het tijdstip moet controleren om te bepalen of het thema moet worden gewijzigd.

source: Warning: Lower value will make the scheduled switching more accurate but may impact the battery.
fr: Attention : Une valeur plus faible rendra la bascule programmé plus précise mais peut avoir un impact sur la batterie.
nl: Waarschuwing: een lagere waarde maakt de planning nauwkeuriger, maar heeft mogelijk meer impact op de accuduur.

source: Indicator logging
fr: Journaux de l'indicateur
nl: Logboek aanleggen

source: Useful for debugging
fr: Utile pour résoudre des anomalies
nl: Nuttig voor foutopsporing

source: Install Indicator
fr: Installer l'indicateur
nl: Indicator toevoegen

source: Uninstall Indicator
fr: Désinstaller l'indicateur
nl: Indicator verwijderen

source: Restart Lomiri/Unity8
fr: Redémarrer Lomiri/Unity8

source: Uninstall the indicator here before uninstalling the app!
fr: Désinstaller l'indicateur ici avant de désinstaller l'application !
nl: Verwijder hier de indicator vóórdat je de app deïnstalleert!

source: Restart Lomiri
fr: Redémarrer Lomiri

source: Do you want to restart Lomiri now?
fr: Voulez-vous redémarrer Lomiri maintenant ?

source: All currently open apps will be closed.
fr: Toutes les applications actuellement ouvertes seront fermées.

source: Save all your work before continuing!
fr: Enregistrez tous vos travaux avant de continuer !

source: Cancel
fr: Annuler

source: Successfully installed!
fr: Installation réalisée avec succès !
nl: De indicator is toegevoegd!

source: Please reboot or restart Lomiri/Unity8
fr: Veuillez réinitialiser ou redémarrer Lomiri/Unity8

source: Failed to install
fr: Échec de l'installation
nl: De indicator kan niet worden toegevoegd

source: Successfully uninstalled!
fr: Désinstallation réalisée avec succès !
nl: De indicator is verwijderd!

source: Failed to uninstall
fr: Échec de la désinstallation
nl: De indicator kan niet worden verwijderd

source: Indicator Suru Dark Mode
fr: Indicateur de mode Suru sombre
nl: Suru donkerthema-indicator

source: Scheduled
fr: Programmé
nl: Ingepland

source: Suru Dark Mode
fr: Mode Suru sombre
nl: Suru donker thema

source: Suru Dark Mode Settings...
fr: Paramètres du mode Suru sombre...

source: Indicator Settings...
nl: Indicatorinstellingen…

source: It modifies the theme in the config file "/home/phablet/.config/lomiri-ui-toolkit/theme.ini"
nl: Het past het thema aan in het configuratiebestand ‘/home/phablet/.config/ubuntu-ui-toolkit/theme.ini’

source: Reinstall the indicator and reboot whenever an update is installed.
nl: Herinstalleer de indicator en herstart na elke update.

source: Always hide indicator icon
nl: Indicatorpictogram verbergen

source: This always hides the icon in the top panel instead of showing when dark mode is enabled.
nl: Hierdoor wordt pictogram op het paneel bovenaan verborgen, zelfs als het donkere thema is ingesteld.

source: Please reboot to enable the indicator
nl: Herstart om de indicator te gebruiken
